{
    "privacyPolicy": {
      "title": "Dasar Privasi",
      "lastUpdated": "Kemaskini Terakhir",
      "sections": {
        "section1": {
          "title": "1. Maklumat yang Kami Kumpulkan",
          "content": {
            "intro": "Kami mengumpulkan jenis maklumat berikut:",
            "list": {
              "personalInfo": "Maklumat Peribadi: Seperti nama anda, alamat emel, nombor telefon, dan alamat rumah.",
              "membershipInfo": "Maklumat Keahlian: Termasuk ID keahlian anda, rekod kecergasan, sejarah tempahan, dan sebagainya.",
              "paymentInfo": "Maklumat Pembayaran: Seperti maklumat akaun bank, maklumat kad kredit, dan lain-lain untuk memproses pembayaran.",
              "usageData": "Data Penggunaan: Maklumat tentang bagaimana anda menggunakan laman web atau aplikasi kami, termasuk maklumat peranti, alamat IP, jenis pelayar, dan sebagainya.",
              "cookies": "Cookies: Kami menggunakan cookies untuk meningkatkan pengalaman pengguna anda. Cookies membantu kami mengingati pilihan anda dan memperbaiki perkhidmatan kami."
            }
          }
        },
        "section2": {
          "title": "2. Bagaimana Kami Menggunakan Maklumat Anda",
          "content": {
            "intro": "Kami menggunakan maklumat yang dikumpulkan untuk tujuan berikut:",
            "list": {
              "manageServices": "Untuk menyediakan dan menguruskan kemudahan sukan, kelas, tempahan, dan perkhidmatan pembayaran kami.",
              "sendNotifications": "Untuk menghantar pemberitahuan keahlian, promosi, dan maklumat lain yang berkaitan (jika anda telah bersetuju).",
              "improveServices": "Untuk memperbaiki perkhidmatan dan pengalaman pelanggan kami.",
              "preventFraud": "Untuk mencegah penipuan dan memastikan keselamatan perkhidmatan kami."
            }
          }
        },
        "section3": {
          "title": "3. Bagaimana Kami Berkongsi Maklumat Anda",
          "content": {
            "intro": "Kami komited untuk tidak menjual atau menyewakan maklumat peribadi anda kepada pihak ketiga. Walau bagaimanapun, kami mungkin berkongsi maklumat anda dengan pihak ketiga dalam kes berikut:",
            "list": {
              "serviceProviders": "Dengan penyedia perkhidmatan kami yang membantu dalam mengendalikan laman web atau menyediakan perkhidmatan seperti pembayaran, komunikasi, dan sebagainya.",
              "legalRequirements": "Untuk mematuhi keperluan undang-undang atau menjawab permintaan sah daripada pihak berkuasa awam."
            }
          }
        },
        "section4": {
          "title": "4. Keselamatan Data",
          "content": {
            "intro": "Kami mengambil langkah teknikal dan organisasi yang sewajarnya untuk melindungi maklumat peribadi anda. Walau bagaimanapun, tiada kaedah penghantaran melalui internet yang dapat menjamin keselamatan 100%, jadi kami tidak dapat memastikan keselamatan mutlak data anda."
          }
        },
        "section5": {
          "title": "5. Hak Anda",
          "content": {
            "intro": "Bergantung pada lokasi anda, anda mungkin mempunyai hak berikut:",
            "list": {
              "accessData": "Mengakses, mengemas kini, atau memadam data peribadi anda.",
              "withdrawConsent": "Menarik balik persetujuan anda untuk pemprosesan data pada bila-bila masa.",
              "restrictProcessing": "Membantah atau meminta sekatan terhadap aktiviti pemprosesan data tertentu."
            },
            "contact": "Untuk menggunakan hak ini, sila hubungi kami di: [Maklumat Hubungan Anda]."
          }
        },
        "section6": {
          "title": "6. Pautan Pihak Ketiga",
          "content": {
            "intro": "Platform kami mungkin mengandungi pautan ke laman web pihak ketiga. Kami tidak bertanggungjawab terhadap amalan privasi laman web tersebut. Kami menggalakkan anda membaca dasar privasi mereka sebelum melawat laman tersebut."
          }
        },
        "section7": {
          "title": "7. Perubahan kepada Dasar Privasi Ini",
          "content": {
            "intro": "Kami mungkin mengemas kini Dasar Privasi ini dari semasa ke semasa. Sebarang kemas kini akan disiarkan di halaman ini, dengan tarikh kemas kini dinyatakan di bahagian atas. Sila semak dasar ini secara berkala untuk mengetahui amalan privasi kami."
          }
        },
        "section8": {
          "title": "8. Hubungi Kami",
          "content": {
            "intro": "Jika anda mempunyai sebarang soalan atau memerlukan bantuan lanjut mengenai Dasar Privasi ini, sila hubungi kami di:",
            "contactDetails": {
              "companyName": "Pusat Sukan KB Baharu",
              "address": "[Alamat Syarikat]",
              "email": "[Emel Hubungan]",
              "phone": "[Nombor Telefon Hubungan]"
            }
          }
        }
      }
    }
  }
  