{
  "privacyPolicy": {
    "title": "Privacy Policy",
    "lastUpdated": "Last Updated",
    "section1": {
      "title": "1. Information We Collect",
      "intro": "We collect the following types of information:",
      "content1": {
        "title": "Personal Information",
        "content1": "Such as your name, email address, phone number, and address."
      },
      "content2": {
        "title": "Membership Information",
        "content1": "Including your membership ID, fitness records, booking history, etc."
      },
      "content3": {
        "title": "Payment Information",
        "content1": "Such as bank account details, credit card information, etc., used for processing payments."
      },
      "content4": {
        "title": "Usage Data",
        "content1": "Information about how you use our website or app, including device information, IP address, browser type, etc."
      },
      "content5": {
        "title": "Cookies",
        "content1": "We use cookies to enhance your user experience. Cookies help us remember your preferences and improve our services."
      }
    },
    "section2": {
      "title": "2. How We Use Your Information",
      "intro": "We use the collected information for the following purposes:",
      "content1": "To provide and manage our sports facilities, classes, bookings, and payment services.",
      "content2": "To send you membership notifications, promotional offers, and other relevant information (if you have agreed).",
      "content3": "To improve our services and customer experience.",
      "content4": "To prevent fraud and ensure the security of our services."
    },
    "section3": {
      "title": "3. How We Share Your Information",
      "intro": "We are committed to not selling or renting your personal information to third parties. However, we may share your information with third parties in the following cases:",
      "content1": "With service providers who assist in operating the website or providing services (such as payment processing, communication, etc.).",
      "content2": "To comply with legal requirements or respond to legitimate requests from public authorities."
    },
    "section4": {
      "title": "4. Data Security",
      "content1": "We take appropriate technical and organizational measures to protect your personal information. However, no method of transmission over the internet can guarantee 100% security, so we cannot ensure the absolute security of your data."
    },
    "section5": {
      "title": "5. Your Rights",
      "intro": "Depending on your location, you may have the following rights:",
      "content1": "To access, update, or delete your personal data." ,
      "content2": "To withdraw your consent for data processing at any time." ,
      "content3": "To object to or request restrictions on certain data processing activities." ,
      "content4": "To exercise these rights, please contact us at: 012-3456789." 
    },
    "section6": {
      "title": "6. Third-Party Links",
      "content1": "Our platform may contain links to third-party websites. We are not responsible for the privacy practices of those websites. We encourage you to read their privacy policies before visiting those sites."
    },
    "section7": {
      "title": "7. Changes to This Privacy Policy",
      "content1": "We may update this Privacy Policy from time to time. Any updates will be posted on this page, with the update date indicated at the top. Please check this policy periodically for any changes to our privacy practices."
    },
    "section8": {
      "title": "8. Contact Us",
      "content1": "If you have any questions or need further assistance regarding this Privacy Policy, please contact us"
    }
  }
}





    