{
  "terms": {
    "title": "Terma dan Syarat",
    "lastUpdated": "Dikemas Kini Terakhir",
    "section1": {
      "title": "1. Pengenalan",
      "content": "Selamat datang ke New KB Sport Center! Terma dan syarat ini mengawal penggunaan aplikasi dan perkhidmatan kami. Dengan mengakses atau menggunakan aplikasi New KB Sport Center, anda bersetuju untuk mematuhi dan terikat dengan terma-terma ini. Jika anda tidak bersetuju dengan mana-mana terma ini, sila jangan gunakan aplikasi tersebut."
    },
    "section2": {
      "title": "Definisi",
      "content1": "\"Aplikasi\" merujuk kepada aplikasi mudah alih dan web New KB Sport Center.",
      "content2": "\"Pengguna\" merujuk kepada individu yang menggunakan aplikasi kami, termasuk ahli, jurulatih, dan kakitangan.",
      "content3": "\"Perkhidmatan\" merujuk kepada semua perkhidmatan yang ditawarkan oleh New KB Sport Center, termasuk keahlian, tempahan fasiliti, pendaftaran kelas, dan pilihan pembayaran.",
      "content4": "\"Penyedia\" merujuk kepada entiti yang menawarkan perkhidmatan, iaitu New KB Sport Center."
    },
    "section3": {
      "title": "3. Hak dan Tanggungjawab Pengguna",
      "content1": {
        "title": "Penciptaan Akaun",
        "content1": "Untuk mengakses perkhidmatan tertentu, anda mesti membuat akaun dengan maklumat yang tepat dan lengkap. Anda bertanggungjawab untuk menjaga kerahsiaan maklumat akaun anda."
      },
      "content2": {
        "title": "Kewajipan Pengguna",
        "content1": "Anda bersetuju untuk menggunakan aplikasi ini hanya untuk tujuan sah, menghormati semua undang-undang dan peraturan yang terpakai. Anda tidak boleh terlibat dalam aktiviti yang membahayakan seperti spam, gangguan, atau memuat naik kandungan yang menyalahi undang-undang."
      },
      "content3": {
        "title": "Penggunaan Dilarang",
        "content1": "Anda dilarang daripada menggunakan aplikasi ini untuk sebarang aktiviti yang menyalahi undang-undang, merbahaya, atau penipuan."
      }
    },
    "section4": {
      "title": "4. Lesen dan Pemilikan",
      "content1": {
        "title": "Lesen",
        "content1": "Kami memberi anda lesen yang terhad, tidak eksklusif, tidak boleh dipindah milik untuk mengakses dan menggunakan aplikasi ini mengikut terma-terma dan syarat-syarat ini."
      },
      "content2": {
        "title": "Harta Intelek",
        "content1": "Semua kandungan, ciri, dan fungsi aplikasi ini, termasuk tanda dagang, logo, dan perisian, dimiliki oleh New KB Sport Center dan dilindungi oleh undang-undang harta intelek."
      }
    },
    "section5": {
      "title": "5. Privasi dan Penggunaan Data",
      "content1": "Privasi anda sangat penting bagi kami. Dengan menggunakan aplikasi ini, anda bersetuju untuk mengumpul, menggunakan, dan berkongsi data peribadi anda mengikut Dasar Privasi kami. Ini mungkin termasuk pengurusan keahlian, tempahan fasiliti, pembayaran, dan tujuan analitik."
    },
    "section6": {
      "title": "6. Kandungan Dihasilkan Pengguna",
      "content1": {
        "title": "Pemilikan Kandungan",
        "content1": "Kandungan yang anda cipta atau muat naik melalui aplikasi (seperti ulasan atau pos) kekal menjadi harta anda, tetapi anda memberi lesen tidak eksklusif, global, dan bebas royalti kepada New KB Sport Center untuk menggunakan, mempamerkan, dan mengedarkan kandungan tersebut sebagai sebahagian daripada perkhidmatan kami."
      },
      "content2": {
        "title": "Pemadaman Kandungan",
        "content1": "Kami berhak untuk memadamkan kandungan yang dihasilkan oleh pengguna yang melanggar dasar kami atau undang-undang yang terpakai."
      }
    },
    "section7": {
      "title": "7. Langganan dan Pembayaran",
      "content1": {
        "title": "Pelan Langganan",
        "content1": "Dengan mendaftar untuk keahlian atau menempah perkhidmatan, anda bersetuju untuk membayar yuran langganan yang berkenaan mengikut terma pembayaran yang dinyatakan. Yuran langganan akan dikenakan mengikut pelan yang dipilih dan kami boleh mengubah harga dengan notis terdahulu."
      },
      "content2": {
        "title": "Pembayaran",
        "content1": "Pembayaran boleh dibuat melalui kad kredit, PayPal, atau kaedah lain yang tersedia. Jika terdapat sebarang isu pembayaran, sila hubungi pasukan sokongan kami."
      },
      "content3": {
        "title": "Pembatalan dan Bayaran Balik",
        "content1": "Bayaran balik untuk langganan dan tempahan hendaklah mengikut Dasar Bayaran Balik kami. Anda boleh membatalkan perkhidmatan mengikut terma yang dinyatakan dalam aplikasi."
      }
    },
    "section8": {
      "title": "8. Tempoh dan Penamatan",
      "content1": {
        "title": "Penamatan Akaun",
        "content1": "Kami berhak untuk menggantung atau menamatkan akaun anda jika anda melanggar mana-mana terma dan syarat ini atau menyalahgunakan aplikasi."
      },
      "content2": {
        "title": "Penamatan Perkhidmatan",
        "content1": "New KB Sport Center boleh menggantung atau menamatkan perkhidmatan mengikut budi bicara mereka. Kami akan memberi notis terlebih dahulu, jika mungkin."
      }
    },
    "section9": {
      "title": "9. Had Tanggungjawab",
      "content1": "Sejauh mana yang dibenarkan oleh undang-undang, New KB Sport Center tidak bertanggungjawab terhadap apa-apa kerosakan langsung, tidak langsung, sampingan, atau berbangkit yang disebabkan oleh penggunaan atau ketidakupayaan untuk menggunakan aplikasi ini, termasuk tetapi tidak terhad kepada kehilangan data atau gangguan perkhidmatan."
    },
    "section10": {
      "title": "10. Penyelesaian Pertikaian",
      "content1": {
        "title": "Undang-undang Terpakai",
        "content1": "Terma dan syarat ini tertakluk kepada undang-undang negara tempat operasi New KB Sport Center."
      },
      "content2": {
        "title": "Arbitrasi",
        "content1": "Sebarang pertikaian yang tidak dapat diselesaikan secara baik akan diselesaikan melalui arbitrasi, dan anda bersetuju untuk memberi kuasa kepada bidang kuasa arbitrasi eksklusif."
      }
    },
    "section11": {
      "title": "11. Pindaan",
      "content1": "New KB Sport Center berhak untuk mengemaskini atau meminda terma dan syarat ini pada bila-bila masa. Sebarang perubahan akan dimaklumkan melalui notis dalam aplikasi, dan penggunaan berterusan aplikasi menunjukkan penerimaan terhadap terma yang telah dipinda."
    },
    "section12": {
      "title": "12. Hubungi Kami",
      "content1": "Untuk sebarang pertanyaan atau kebimbangan mengenai terma dan syarat ini, sila hubungi kami di: support@newkbsportcenter.com",
      "content2": "Telefon: +123-456-7890"
    },
    "section13": {
      "title": "13. Lain-lain",
      "content1": {
        "title": "Kekuatan Utama",
        "content1": "New KB Sport Center tidak bertanggungjawab atas sebarang kelewatan atau kegagalan untuk memenuhi kewajiban yang disebabkan oleh keadaan di luar kawalan mereka."
      },
      "content2": {
        "title": "Keupayaan Pemisahan",
        "content1": "Sekiranya mana-mana bahagian terma dan syarat ini dianggap tidak sah atau tidak boleh dikuatkuasakan, bahagian lain akan tetap berkuat kuasa sepenuhnya."
      }
    }
  }
}
